{
  "education": [
    {
      "awards_achievements": [
        "Wond gold medal for paper presentation on IOT integration for TRMS control systems"
      ],
      "degree": "Bachelor of Engineering",
      "department": "Electronics and Instrumentation Engineering",
      "duration": "2015-2019",
      "school_name": "SRM university"
    },
    {
      "awards_achievements": [
        "GPA: 3.89/4.0"
      ],
      "degree": "Post graduate certificate",
      "department": "Robotics and Industrial automation",
      "duration": "2020-2021",
      "school_name": "Conestoga College"
    }
  ],
  "github_repo_root_url": "https://github.com/jarviscanada/jarvis_data_eng_SanthoshSrinivasagan",
  "highlighted_projects": [
    {
      "description": "A Java console application for managing students information. The user can access, create, and edit the information of a student in this application and store it in a file. All student information is stored in a text file, including an 8-digit student ID, the student's first name, last name, the program name, courses, GPA and tuition",
      "git_url": "https://github.com/Santhosh-Srini/StudentManagementSystem",
      "name": "Student Management System"
    }
  ],
  "jarvis_projects": [
    {
      "description": "The Jarvis Linux Cluster Monitoring Agent manages a linux cluster of servers running linux distribution of CentOS 7. With this set of scripts, users have the ability to gather data on hardware information and usage of all servers in the cluster in one database, compare results and analyze the effective utilization of hardware resources. The Linux Cluster Administration Team at Jarvis would use this product to manage their 10 CentOS servers which are connected via a network switch. The project was designed, implemented, tested, and deployed with; *Git, Docker, Bash Scripts, CentOS 7, PostgreSQL, and Google Cloud Platform*",
      "git_url": "/linux_sql",
      "name": "Cluster Monitor"
    },
    {
      "description": "Developed a proof-of-concept project to help an online gift store analyze their sales data and find effective marketing strategies. For this project, we used Jupyter, a Python notebook, to perform our analyses. A PostgreSQL data warehouse was used to store client retail data. Using Pandas, NumPy, and MatPlotLib, we manipulate the dataset and display the results. By using RFM market research, we were able to segment customers so that the store could develop marketing campaigns targeting both old and new customers.",
      "git_url": "/python_data_analytics",
      "name": "Python Data Analytics"
    },
    {
      "description": [
        "**Grep App:** Created the Java Grep Application which is an implementation of the Linux Grep command which search for a string of characters in a given directory and outputs them to another file. The application was created with Java Lambda/Steam API's with Apache Maven and deployed using Docker",
        "**JDBC App:** Constructed the JDBC application to perform CRUD operations using DAO and DTO design patterns on a PostgreSQL retail store's database",
        "The projects were designed, implemented, tested, and deployed with; *Git, Docker, PostgreSQL, Java [Lambda/Steam Functions], Apache Maven, DAO Design Pattern, Spring, JDBC API, Twitter Rest API, and Google Cloud Platform*"
      ],
      "git_url": "/core_java",
      "name": "Core Java Apps"
    }
  ],
  "name": "Santhosh Srinivasagan",
  "others": [
    {
      "bullets": [
        "Matlab and Octave by edX (2017)",
        "Linkedin learning Java (2022)",
        "Linkedin learning Python (2022)"
      ],
      "title": "Certificates"
    }
  ],
  "professional_experience": [
    {
      "company": "Jarvis",
      "description": "Worked as a Data Engineer in an Agile/Scrum environment to develop and implement solutions to various problems within the Jarvis team as well as small businesses within the community. The projects were implemented using Git/GitHub, Docker, Bash Scripts, CentOS 7, PostgreSQL, Python, Java SE 8, Apache Maven, Apache Tomcat, JDBC API, and cloud platform.",
      "duration": "2022-present",
      "title": "Junior Software Developer"
    },
    {
      "company": "Linamar corporation",
      "description": "Analyzing and troubleshooting PLC program. Proven ability to work in a team environment. Writing SQL queries for storing and extracting parts information. Programming Abb \u0026 Fanuc Robots. Programming Allen Bradly suite of PLC and HMI. Debugging and patching existing programs.",
      "duration": "2021-2022",
      "title": "Junior Automation Technician"
    }
  ],
  "skills": {
    "competent": [
      "Cloud computing",
      ".NET framework",
      "Object Oriented Programming",
      "Matlab",
      "Data structures and algorithms"
    ],
    "familiar": [
      "Raspberry pi",
      "Google Cloud platform",
      "PostgresSQL",
      "Swift",
      "Android studio"
    ],
    "proficient": [
      "Java",
      "Python",
      "Linux/Bash",
      "RDBMS/SQL",
      "Agile/Scrum",
      "Maven",
      "Docker",
      "Git"
    ]
  },
  "summary": "Working as a robotics programmer and having an electrical engineering background has prepared me to have a mindset of being open to learning any number of tools or technologies to solve a problem. At Jarvis, I developed skills in Java, Python, Git, SQL, Bash, Maven, and Docker while participating in various challenging projects using an Agile/Scrum framework. My propelling interest in debugging and solving complex problems in any of my project endeavors developed my desire to be working in an environment that challenges this aspect of my skill set by demanding innovative problem-solving abilities. After realizing how satisfying it is to solve technical problems using logical thinking, I decided to switch careers to data engineering. Over the next few years, I would go on to teach myself data structures, algorithms, and programming through various courses and projects."
}
